src/cf/maERP_ib/src/InformationRegisters/ПлановыеПоказатели/ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеПоказатели</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>План</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Факт</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодитель</name>
    <comment>Для связи в виде &quot;Дерево&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/ПлановыеПоказатели/ManagerModule.bsl
Функция ПолучитьПоСотруднику(Период, Сотрудник) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПлановыеПоказатели.Показатель КАК Показатель,
	                      |	ПлановыеПоказатели.Показатель.SMART КАК SMART,
	                      |	ПлановыеПоказатели.Показатель.Веса КАК Веса,
	                      |	ПлановыеПоказатели.План КАК План,
	                      |	ПлановыеПоказатели.Факт КАК Факт,
	                      |	ПлановыеПоказатели.Стоимость КАК Стоимость,
	                      |	ПлановыеПоказатели.Комментарий КАК Комментарий,
	                      |	ПлановыеПоказатели.ID КАК ID,
	                      |	ПлановыеПоказатели.IDРодитель КАК IDРодитель
	                      |ИЗ
	                      |	РегистрСведений.ПлановыеПоказатели КАК ПлановыеПоказатели
	                      |ГДЕ
	                      |	ПлановыеПоказатели.Период = &Период
	                      |	И ПлановыеПоказатели.Сотрудник = &Сотрудник");
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции
